package Number;

public class Number_Conversion {
    // Перевести число 333 из шестнадцатиричной в десятичную
//   num333 = 3 * 16 ^ 2 + 3 * 16 ^ 1 + 3 * 16 ^ 0 = 819


//    Разложить число 200345 на разряды в десятичной системе
//        5 , 40 , 300 , 1000 , 10000, 200000

//    Перевести 637 из десятичной в шестнадцатиричную и обратно (10->16 и 16->10)
//    num 637 = 637 / 16 = 39 / 16 = 2
//                13 = D      7
//  num = 27D

//  num 27D = 2 * 16 ^ 2 + 7 * 16 ^ 1 + 13 * 16 ^ 1 = 637


//  Перевести 637 из десятичной в двоичную

//    num = 1001111101

//  11100111 перевести в десятичную

// num 11100111 = 1 * 2 ^ 7 + 1 * 2 ^ 6 + 1 * 2 ^ 5 + 1 * 2 ^ 2 + 1 * 2 ^ 1 + 1 * 2 ^ 0 = 231

//    Перевести 637 из десятичной в троичную
//    num 637 = 212121
}
